In [10]:
# Load the Employee DataFrame from the CSV file
import numpy as np
import pandas as pd

employee_df = pd.read_csv('employee.csv')

# Split the Name column
employee_df[['First Name', 'Last Name']] = employee_df['Name'].str.split(' ', 1, expand=True)
employee_df.drop(columns=['Name'], inplace=True)

# Save the modified Employee DataFrame
employee_df.to_csv('employee.csv', index=False)

In [11]:
employee_df.head()

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny